app/views/books/_index.html.erb

        </td>
        <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>
---
SELECT "books".* FROM "books"