app/views/books/_index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        </td>
        <td><%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %></td>