app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "favorites" ("created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-02-02 00:32:25.811324"], ["updated_at", "2021-02-02 00:32:25.811324"], ["user_id", 1], ["book_id", 1]]
---
  def create
    @book = Book.find( params[:book_id])
    @favorite = current_user.favorites.new(book_id: @book.id)
    @favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 7]]
---
  def destroy
    @book = Book.find( params[:book_id])
    @favorite = current_user.favorites.find_by(book_id: @book.id)
    @favorite.destroy