app/controllers/searchs_controller.rb

  def match(model, content)
    if model == 'user'
       User.where(name: content)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "望月隼寿"]]